<?xml version="1.0"?>
<net name="TensorFlow_Lite_Frontend_IR" version="11">
	<layers>
		<layer id="2" name="hand" type="Parameter" version="opset1">
			<data shape="1,21,3" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="hand">
					<dim>1</dim>
					<dim>21</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="handedness" type="Parameter" version="opset1">
			<data shape="1,1" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="handedness">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="world_hand" type="Parameter" version="opset1">
			<data shape="1,21,3" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="world_hand">
					<dim>1</dim>
					<dim>21</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="model_4/tf.compat.v1.gather_3/GatherV2/indices" type="Const" version="opset1">
			<data element_type="i32" shape="6" offset="0" size="24" />
			<output>
				<port id="0" precision="I32" names="model_4/tf.compat.v1.gather_3/GatherV2/indices">
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_64887" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="24" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="5" name="0" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>6</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="model_4/tf.compat.v1.gather_3/GatherV2;model_4/tf.compat.v1.gather_3/GatherV2/axis">
					<dim>1</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="model_4/tf.compat.v1.gather_3/GatherV2/axis" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="24" size="4" />
			<output>
				<port id="0" precision="I32" names="model_4/tf.compat.v1.gather_3/GatherV2/axis" />
			</output>
		</layer>
		<layer id="7" name="1" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.math.reduce_mean_3/Mean">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="2" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.math.subtract_9/Sub">
					<dim>1</dim>
					<dim>21</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_64891" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="28" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="10" name="Split_64892" type="Split" version="opset1">
			<data num_splits="3" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Squeeze_64893" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.unstack_3/unstack">
					<dim>1</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="model_4/tf.math.reduce_max_6/Max/reduction_indices" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="36" size="4" />
			<output>
				<port id="0" precision="I32" names="model_4/tf.math.reduce_max_6/Max/reduction_indices" />
			</output>
		</layer>
		<layer id="13" name="4" type="ReduceMax" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.math.reduce_max_6/Max">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="6" type="ReduceMin" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.math.reduce_min_6/Min">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="7" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.math.subtract_10/Sub">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Squeeze_64894" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.unstack_3/unstack1">
					<dim>1</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="5" type="ReduceMax" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.math.reduce_max_7/Max">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="8" type="ReduceMin" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.math.reduce_min_7/Min">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="9" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.math.subtract_11/Sub">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="10" type="Maximum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.math.maximum_3/Maximum">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="model_4/tf.__operators__.getitem_3/strided_slice/stack_2" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="40" size="12" />
			<output>
				<port id="0" precision="I32" names="model_4/tf.__operators__.getitem_3/strided_slice/stack_2">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="11" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.__operators__.getitem_3/strided_slice,model_4/tf.__operators__.getitem_3/strided_slice1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_66979" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="52" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="13" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.__operators__.add_12/AddV2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="14" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.math.truediv_3/truediv">
					<dim>1</dim>
					<dim>21</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="model_4/reshape_1/Reshape/shape" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="56" size="8" />
			<output>
				<port id="0" precision="I32" names="model_4/reshape_1/Reshape/shape">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="15" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>21</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/reshape_1/Reshape">
					<dim>1</dim>
					<dim>63</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="model_4/dense_12/MatMul" type="Const" version="opset1">
			<data element_type="f32" shape="128, 63" offset="64" size="32256" />
			<output>
				<port id="0" precision="FP32" names="model_4/dense_12/MatMul">
					<dim>128</dim>
					<dim>63</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="MatMul_64917" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>63</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>63</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_66980" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128" offset="32320" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="16" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/dense_12/MatMul;model_4/dense_12/BiasAdd">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="model_4/batch_normalization_10/batchnorm/mul_1" type="Const" version="opset1">
			<data element_type="f32" shape="128, 63" offset="32832" size="32256" />
			<output>
				<port id="0" precision="FP32" names="model_4/batch_normalization_10/batchnorm/mul_1">
					<dim>128</dim>
					<dim>63</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="MatMul_64928" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>63</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>63</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_66981" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128" offset="65088" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="17" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="17_1" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_4/dense_12/MatMul;model_4/dense_12/BiasAdd;model_4/batch_normalization_10/batchnorm/mul_1;model_4/re_lu_10/Relu;model_4/batch_normalization_10/batchnorm/add_1">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="model_4/dense_13/MatMul" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128" offset="65600" size="65536" />
			<output>
				<port id="0" precision="FP32" names="model_4/dense_13/MatMul">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="MatMul_64940" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_66982" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128" offset="131136" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="18" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/dense_13/MatMul;model_4/dense_13/BiasAdd">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="19" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.__operators__.add_13/AddV2">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_66983" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128" offset="131648" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="20" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/batch_normalization_11/batchnorm/mul_1">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_66984" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128" offset="132160" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Add_64944" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="21" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_4/re_lu_11/Relu;model_4/batch_normalization_11/batchnorm/add_1">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="model_4/dense_14/MatMul" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128" offset="132672" size="65536" />
			<output>
				<port id="0" precision="FP32" names="model_4/dense_14/MatMul">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="MatMul_64955" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_66985" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128" offset="198208" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="22" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/dense_14/MatMul;model_4/dense_14/BiasAdd">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="23" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.__operators__.add_14/AddV2">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_66986" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128" offset="198720" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="24" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/batch_normalization_12/batchnorm/mul_1">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_66987" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128" offset="199232" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Add_64959" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="25" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_4/re_lu_12/Relu;model_4/batch_normalization_12/batchnorm/add_1">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="model_4/dense_15/MatMul" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128" offset="199744" size="65536" />
			<output>
				<port id="0" precision="FP32" names="model_4/dense_15/MatMul">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="MatMul_64970" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_66988" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128" offset="265280" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="26" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/dense_15/MatMul;model_4/dense_15/BiasAdd">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="27" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.__operators__.add_15/AddV2">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_66989" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128" offset="265792" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="28" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/batch_normalization_13/batchnorm/mul_1">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_66990" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128" offset="266304" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Add_64974" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="29" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_4/re_lu_13/Relu;model_4/batch_normalization_13/batchnorm/add_1">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="model_4/dense_16/MatMul" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128" offset="266816" size="65536" />
			<output>
				<port id="0" precision="FP32" names="model_4/dense_16/MatMul">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="MatMul_64985" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Constant_66991" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128" offset="332352" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="30" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/dense_16/MatMul;model_4/dense_16/BiasAdd">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="31" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.__operators__.add_16/AddV2">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_66992" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128" offset="332864" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="32" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/batch_normalization_14/batchnorm/mul_1">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_66993" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128" offset="333376" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Add_64989" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="33" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_4/re_lu_14/Relu;model_4/batch_normalization_14/batchnorm/add_1">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="model_4/dense_17/MatMul" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128" offset="333888" size="65536" />
			<output>
				<port id="0" precision="FP32" names="model_4/dense_17/MatMul">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="MatMul_65000" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Constant_66994" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128" offset="399424" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="34" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/dense_17/MatMul;model_4/dense_17/BiasAdd">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="35" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.__operators__.add_17/AddV2">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Constant_66995" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128" offset="399936" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="36" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/batch_normalization_15/batchnorm/mul_1">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Constant_66996" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128" offset="400448" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Add_65004" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="37" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_4/re_lu_15/Relu;model_4/batch_normalization_15/batchnorm/add_1">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="model_4/dense_18/MatMul" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128" offset="400960" size="65536" />
			<output>
				<port id="0" precision="FP32" names="model_4/dense_18/MatMul">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="MatMul_65015" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_66997" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128" offset="466496" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="38" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/dense_18/MatMul;model_4/dense_18/BiasAdd">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="39" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/tf.__operators__.add_18/AddV2">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_66998" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128" offset="467008" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="40" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="model_4/batch_normalization_16/batchnorm/mul_1">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_66999" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128" offset="467520" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Add_65019" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="41" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="model_4/re_lu_16/Relu;model_4/batch_normalization_16/batchnorm/add_1">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="model_4/batch_normalization_17/batchnorm/mul_1" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128" offset="468032" size="65536" />
			<output>
				<port id="0" precision="FP32" names="model_4/batch_normalization_17/batchnorm/mul_1">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="MatMul_65030" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_67000" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128" offset="533568" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="42" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="42_1" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="Identity">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Result_65033" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="2" from-port="0" to-layer="8" to-port="0" />
		<edge from-layer="2" from-port="0" to-layer="5" to-port="0" />
		<edge from-layer="3" from-port="0" to-layer="5" to-port="1" />
		<edge from-layer="4" from-port="0" to-layer="5" to-port="2" />
		<edge from-layer="5" from-port="3" to-layer="7" to-port="0" />
		<edge from-layer="6" from-port="0" to-layer="7" to-port="1" />
		<edge from-layer="7" from-port="2" to-layer="8" to-port="1" />
		<edge from-layer="8" from-port="2" to-layer="25" to-port="0" />
		<edge from-layer="8" from-port="2" to-layer="10" to-port="0" />
		<edge from-layer="9" from-port="0" to-layer="11" to-port="1" />
		<edge from-layer="9" from-port="0" to-layer="10" to-port="1" />
		<edge from-layer="9" from-port="0" to-layer="16" to-port="1" />
		<edge from-layer="10" from-port="2" to-layer="11" to-port="0" />
		<edge from-layer="10" from-port="3" to-layer="16" to-port="0" />
		<edge from-layer="11" from-port="2" to-layer="13" to-port="0" />
		<edge from-layer="11" from-port="2" to-layer="14" to-port="0" />
		<edge from-layer="12" from-port="0" to-layer="17" to-port="1" />
		<edge from-layer="12" from-port="0" to-layer="18" to-port="1" />
		<edge from-layer="12" from-port="0" to-layer="14" to-port="1" />
		<edge from-layer="12" from-port="0" to-layer="13" to-port="1" />
		<edge from-layer="13" from-port="2" to-layer="15" to-port="0" />
		<edge from-layer="14" from-port="2" to-layer="15" to-port="1" />
		<edge from-layer="15" from-port="2" to-layer="20" to-port="0" />
		<edge from-layer="16" from-port="2" to-layer="17" to-port="0" />
		<edge from-layer="16" from-port="2" to-layer="18" to-port="0" />
		<edge from-layer="17" from-port="2" to-layer="19" to-port="0" />
		<edge from-layer="18" from-port="2" to-layer="19" to-port="1" />
		<edge from-layer="19" from-port="2" to-layer="20" to-port="1" />
		<edge from-layer="20" from-port="2" to-layer="22" to-port="0" />
		<edge from-layer="21" from-port="0" to-layer="22" to-port="1" />
		<edge from-layer="22" from-port="2" to-layer="24" to-port="0" />
		<edge from-layer="23" from-port="0" to-layer="24" to-port="1" />
		<edge from-layer="24" from-port="2" to-layer="25" to-port="1" />
		<edge from-layer="25" from-port="2" to-layer="27" to-port="0" />
		<edge from-layer="26" from-port="0" to-layer="27" to-port="1" />
		<edge from-layer="27" from-port="2" to-layer="29" to-port="0" />
		<edge from-layer="27" from-port="2" to-layer="33" to-port="0" />
		<edge from-layer="28" from-port="0" to-layer="29" to-port="1" />
		<edge from-layer="29" from-port="2" to-layer="31" to-port="0" />
		<edge from-layer="30" from-port="0" to-layer="31" to-port="1" />
		<edge from-layer="31" from-port="2" to-layer="41" to-port="0" />
		<edge from-layer="32" from-port="0" to-layer="33" to-port="1" />
		<edge from-layer="33" from-port="2" to-layer="35" to-port="0" />
		<edge from-layer="34" from-port="0" to-layer="35" to-port="1" />
		<edge from-layer="35" from-port="2" to-layer="36" to-port="0" />
		<edge from-layer="36" from-port="1" to-layer="38" to-port="0" />
		<edge from-layer="37" from-port="0" to-layer="38" to-port="1" />
		<edge from-layer="38" from-port="2" to-layer="40" to-port="0" />
		<edge from-layer="39" from-port="0" to-layer="40" to-port="1" />
		<edge from-layer="40" from-port="2" to-layer="41" to-port="1" />
		<edge from-layer="41" from-port="2" to-layer="43" to-port="0" />
		<edge from-layer="41" from-port="2" to-layer="51" to-port="0" />
		<edge from-layer="42" from-port="0" to-layer="43" to-port="1" />
		<edge from-layer="43" from-port="2" to-layer="45" to-port="0" />
		<edge from-layer="44" from-port="0" to-layer="45" to-port="1" />
		<edge from-layer="45" from-port="2" to-layer="46" to-port="0" />
		<edge from-layer="46" from-port="1" to-layer="48" to-port="0" />
		<edge from-layer="47" from-port="0" to-layer="48" to-port="1" />
		<edge from-layer="48" from-port="2" to-layer="50" to-port="0" />
		<edge from-layer="49" from-port="0" to-layer="50" to-port="1" />
		<edge from-layer="50" from-port="2" to-layer="51" to-port="1" />
		<edge from-layer="51" from-port="2" to-layer="53" to-port="0" />
		<edge from-layer="51" from-port="2" to-layer="61" to-port="0" />
		<edge from-layer="52" from-port="0" to-layer="53" to-port="1" />
		<edge from-layer="53" from-port="2" to-layer="55" to-port="0" />
		<edge from-layer="54" from-port="0" to-layer="55" to-port="1" />
		<edge from-layer="55" from-port="2" to-layer="56" to-port="0" />
		<edge from-layer="56" from-port="1" to-layer="58" to-port="0" />
		<edge from-layer="57" from-port="0" to-layer="58" to-port="1" />
		<edge from-layer="58" from-port="2" to-layer="60" to-port="0" />
		<edge from-layer="59" from-port="0" to-layer="60" to-port="1" />
		<edge from-layer="60" from-port="2" to-layer="61" to-port="1" />
		<edge from-layer="61" from-port="2" to-layer="63" to-port="0" />
		<edge from-layer="61" from-port="2" to-layer="71" to-port="0" />
		<edge from-layer="62" from-port="0" to-layer="63" to-port="1" />
		<edge from-layer="63" from-port="2" to-layer="65" to-port="0" />
		<edge from-layer="64" from-port="0" to-layer="65" to-port="1" />
		<edge from-layer="65" from-port="2" to-layer="66" to-port="0" />
		<edge from-layer="66" from-port="1" to-layer="68" to-port="0" />
		<edge from-layer="67" from-port="0" to-layer="68" to-port="1" />
		<edge from-layer="68" from-port="2" to-layer="70" to-port="0" />
		<edge from-layer="69" from-port="0" to-layer="70" to-port="1" />
		<edge from-layer="70" from-port="2" to-layer="71" to-port="1" />
		<edge from-layer="71" from-port="2" to-layer="73" to-port="0" />
		<edge from-layer="71" from-port="2" to-layer="81" to-port="0" />
		<edge from-layer="72" from-port="0" to-layer="73" to-port="1" />
		<edge from-layer="73" from-port="2" to-layer="75" to-port="0" />
		<edge from-layer="74" from-port="0" to-layer="75" to-port="1" />
		<edge from-layer="75" from-port="2" to-layer="76" to-port="0" />
		<edge from-layer="76" from-port="1" to-layer="78" to-port="0" />
		<edge from-layer="77" from-port="0" to-layer="78" to-port="1" />
		<edge from-layer="78" from-port="2" to-layer="80" to-port="0" />
		<edge from-layer="79" from-port="0" to-layer="80" to-port="1" />
		<edge from-layer="80" from-port="2" to-layer="81" to-port="1" />
		<edge from-layer="81" from-port="2" to-layer="91" to-port="0" />
		<edge from-layer="81" from-port="2" to-layer="83" to-port="0" />
		<edge from-layer="82" from-port="0" to-layer="83" to-port="1" />
		<edge from-layer="83" from-port="2" to-layer="85" to-port="0" />
		<edge from-layer="84" from-port="0" to-layer="85" to-port="1" />
		<edge from-layer="85" from-port="2" to-layer="86" to-port="0" />
		<edge from-layer="86" from-port="1" to-layer="88" to-port="0" />
		<edge from-layer="87" from-port="0" to-layer="88" to-port="1" />
		<edge from-layer="88" from-port="2" to-layer="90" to-port="0" />
		<edge from-layer="89" from-port="0" to-layer="90" to-port="1" />
		<edge from-layer="90" from-port="2" to-layer="91" to-port="1" />
		<edge from-layer="91" from-port="2" to-layer="93" to-port="0" />
		<edge from-layer="92" from-port="0" to-layer="93" to-port="1" />
		<edge from-layer="93" from-port="2" to-layer="95" to-port="0" />
		<edge from-layer="94" from-port="0" to-layer="95" to-port="1" />
		<edge from-layer="95" from-port="2" to-layer="96" to-port="0" />
		<edge from-layer="96" from-port="1" to-layer="98" to-port="0" />
		<edge from-layer="97" from-port="0" to-layer="98" to-port="1" />
		<edge from-layer="98" from-port="2" to-layer="100" to-port="0" />
		<edge from-layer="99" from-port="0" to-layer="100" to-port="1" />
		<edge from-layer="100" from-port="2" to-layer="101" to-port="0" />
		<edge from-layer="101" from-port="1" to-layer="102" to-port="0" />
	</edges>
	<rt_info>
		<Runtime_version value="2025.0.0-17942-1f68be9f594-releases/2025/0" />
		<conversion_parameters>
			<input_model value="DIR/gesture_embedder.tflite" />
			<is_python_object value="False" />
		</conversion_parameters>
	</rt_info>
</net>
